CSI API ETABS v1
cAnalyze.SetSolverOption Method
 DEPRECATED. Please see SetSolverOption_2(Int32, Int32, Int32, String) or SetSolverOption_3(Int32, Int32, Int32, Int32, Int32, String)
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSolverOption(
	int SolverType,
	bool Force32BitSolver,
	string StiffCase = ""
)
Function SetSolverOption (
	SolverType As Integer,
	Force32BitSolver As Boolean,
	Optional StiffCase As String = ""
) As Integer
Dim instance As cAnalyze
Dim SolverType As Integer
Dim Force32BitSolver As Boolean
Dim StiffCase As String
Dim returnValue As Integer
returnValue = instance.SetSolverOption(SolverType,
	Force32BitSolver, StiffCase)
int SetSolverOption(
	int SolverType,
	bool Force32BitSolver,
	String^ StiffCase = L""
)
abstract SetSolverOption :
        SolverType : int *
        Force32BitSolver : bool *
        ?StiffCase : string
(* Defaults:
        let _StiffCase = defaultArg StiffCase ""
*)
-> int
Parameters
SolverType
Type: System.Int32
Force32BitSolver
Type: System.Boolean
StiffCase (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace